const _i18n = {

    'Негативные': ['Negative', 'Негативті'],
    'Нейтральные': ['Neutral', 'Бейтарап'],
    'Позитивные': ['Positive', 'Позитивті'],

    'Негатив': ['Negative', 'Негатив'],
    'Нейтрал': ['Neutral', 'Бейтарап'],
    'Позитив': ['Positive', 'Позитив'],

    'Выберите период': ['Select a period', 'Деректерді жинау кезеңі'],

    'Пн': ['Mon', 'Дсн'],
    'Вт': ['Tue', 'Сейс'],
    'Ср': ['Wed', 'Сәрс'],
    'Чт': ['Thu', 'Бсн'],
    'Пт': ['Fri', 'Жм'],
    'Сб': ['Sat', 'Сб'],
    'Вс': ['Sun', 'Жс'],

    'За весь вериод': ['All period', 'Бүкіл кезең бойынша'],
    'Сегодня': ['Today', 'Бүгін'],
    'Вчера': ['Yesterday', 'Кеше'],
    'Неделя': ['Week', 'Апта'],
    '30 дней': ['30 days', '30 күн'],
    'Текущий месяц': ['This month', 'Осы ай'],
    'Прошлый месяц': ['Last month', 'Өткен ай'],

    "Январь": ['January', 'Қаңтар'],
    "Февраль": ['February', 'Ақпан'],
    "Март": ['March', 'Наурыз'],
    "Апрель": ['April', 'Сәуір'],
    "Май": ['May', 'Мамыр'],
    "Июнь": ['June', 'Маусым'],
    "Июль": ['July', 'Шілде'],
    "Август": ['August', 'Тамыз'],
    "Сентябрь": ['September', 'Қыркүйек'],
    "Октябрь": ['October', 'Қазан'],
    "Ноябрь": ['November', 'Қараша'],
    "Декабрь": ['December', 'Желтоқсан'],

    "Янв": ['Jan', 'Қаңтар'],
    "Фев": ['Feb', 'Aқпан'],
    //"Март": ['March', 'Наурыз'],
    "Апр": ['Apr', 'Сәуір'],
    //"Май": ['May', 'Мамыр'],
    //"Июнь": ['June', 'Маусым'],
    //"Июль": ['July', 'Шілде'],
    "Авг": ['Aug', 'Тамыз'],
    "Сент": ['Sept', 'Қыркүйек'],
    "Окт": ['Oct', 'Қазан'],
    "Ноя": ['Nov', 'Қараша'],
    "Дек": ['Dec', 'Желтоқсан'],

    "Воскресенье": ['Sunday', 'Жексенбі'],
    "Понедельник": ['Monday', 'Дүйсенбі'],
    "Вторник": ['Tuesday', 'Сейсенбі'],
    "Среда": ['Wednesday', 'Сәрсенбі'],
    "Четверг": ['Thursday', 'Бейсенбі'],
    "Пятница": ['Friday', 'Жұма'],
    "Суббота": ['Saturday', 'Сенбі'],

    'Применить': ["Apply", "Қолдану"],

    'Экспорт': ["Export", "Экспорт"],

    'Страны источников публикаций': ["Countries of publication sources", "Жаңалықтар дереккөздерінің мемлекеті"],
    'Регионы источников публикаций': ["Regions of publication sources", "Жаңалықтар дереккөздерінің аймақтары"],
    'Тональность по странам': ["Sentiment by countries", "Мемлекеттер бойынша көңіл-күй"],
    'Тональность по регионам': ["Sentiment by regions", "Аймақтар бойынша көңіл-күй"],

    "Карта": ["Map", "Карта"],
    "Тональность": ["Sentiment", "Көңіл-күй"],

    "Абсолютный": ["Absolute", "Абсолютті"],
    "Доля": ["Proportion", "Бөлісу"],

    "Регионы": ["Regions", "Аймақтар"],
    "Все страны": ["All countries", "Мемлекеттер"],
    "Страна": ["Country", "Мемлекет"],

    "Регион": ["Region", "Аймақ"],
    "Публикаций": ["Publications", "Басылымдар"],
    "Публикация": ["Publication", "Басылым"],
    "Источников": ["Sources", "Дереккөздер"],
    "Источники": ["Sources", "Дереккөздер"],
    "Источник": ["Source", "Дереккөз"],
    
    "Динамика публикаций": ["Publication dynamics", "Жариялану динамикасы"],
    "Динамика публикаций по тональности": ["Dynamics of publications by sentiment", "Тональность бойынша жарияланымдар динамикасы"],

    "по часам<br/>• если период не более 7 дней": ["by hours<br/>• if the period is not more than 7 days", "сағат бойынша<br/>• егер кезең 7 күннен аспаса"],
    "по дням": ["by days", "күндер бойынша"],
    "по неделям<br/>• если период от 7 дней": ["by weeks<br/>• if the period is from 7 days", "апталар бойынша<br/>• егер кезең 7 күннен бастап болса"],
    "по месяцам<br/>• если период от 3 дней": ["by months<br/>• if the period is from 3 days", "айлар бойынша<br/>• егер кезең 3 күннен бастап болса"],

    "Язык публикаций": ["Publication language", "Жаңалықтар тілі"],
    "Казахский": ["Kazakh", "Қазақ"],
    "Русский": ["Russian", "Орыс"],
    "Английский": ["English", "Ағылшын"],
    "Другие": ["Others", "Басқа"],

    "Категория": ["Category", "Категория"],
    "Категория источника": ["Source category", "Дереккөз категориясы"],
    "Государственные источники": ["Government sources", "Мемлекеттік ақпарат көздері"],
    "Информационные агентства": ["News agencies", "Ақпарат агенттіктері"],
    "Региональные источники": ["Regional sources", "Аймақтық дереккөздер"],
    "Электронные СМИ": ["Electronic media", "Электрондық ақпарат құралдары"],
    "Специализированные": ["Specialized", "Мамандандырылған"],
    "Зарубежные источники": ["Foreign sources", "Шетелдік ақпарат көздері"],
    "Государственные закупки": ["State procurements", "Мемлекеттік сатып алулар"],
    "LiveJournal": ["LiveJournal", "Live Journal"],
    "Печатные СМИ": ["Print mass-media", "Баспа құралдары"],
    "Телевидение": ["A television", "Теледидар"],
    "Радио": ["Radio", "Радио"],
    "Агрегаторы СМИ": ["Media aggregators", "Медиа агрегаторлар"],
    "Печатные издания": ["Printed editions", "Баспа басылымдары"],

    "Метрики соцсетей": ["Social Metrics", "Әлеуметтік медиа метрикалары"],
    "Лайки": ["Likes", "Ұнатады"],
    "Репосты": ["Reposts", "Репосттар"],
    "Подписчики": ["Subscribers", "Жазылушылар"],

    "Источники публикаций": ["Publication sources", "Жаңалық көздері"],
    "Тональность источников": ["Sentiment of sources", "Дереккөздердің көңіл-күйі"],

    "Количество публикаций": ["Number of publications", "Жарияланымдар саны"],
    "Доля публикаций на выделенных источниках": ["Share of publications on selected sources", "Таңдалған дереккөздер бойынша жарияланымдар үлесі"],

    "При сборе метрик для большого числа публикаций метрики по умолчанию выкл.": [
        "When collecting metrics for a large number of posts, the default metrics are off.",
        "Жазбалардың көп саны үшін көрсеткіштерді жинаған кезде, әдепкі көрсеткіштер өшірулі."
    ],
    "Идёт сбор метрик для большого числа публикаций.": [
        "There is a collection of metrics for a large number of publications.",
        "Жарияланымдар санының көптігі үшін көрсеткіштер жинағы бар."
    ],
    "Будет готово через несколько секунд🤓": [
        "Will be ready in a few seconds🤓",
        "Бірнеше секундта дайын болады🤓"
    ],

    "Результат фильтра": ["Filter Result", "Фильтрдің нәтижесі"],

    "Сортировка по лайкам (по убыванию)": ["Sort by likes (desc)", "Ұнатулар бойынша сұрыптау (төмендету)"],
    "Сортировка по комментариям (по убыванию)": ["Sort by comments (desc)", "Түсініктемелер бойынша сұрыптау (төмендету)"],
    "Сортировка по репостам (по убыванию)": ["Sort by reposts (desc)", "Репосттар бойынша сұрыптау (төмендету)"],
    "Сортировка по аудитории (по убыванию)": ["Sort by audience (desc)", "Аудитория бойынша сұрыптау (төмендету)"],
    "Сортировка по дате (по убыванию)": ["Sort by date (desc)", "Күні бойынша сұрыптау (төмендету)"],

    "По одной": ["One by one", "Бір-бірден"],
    "По группам": ["By groups", "Топтар бойынша"],

    "Удалить новость": ["Delete news", "Жаңалықты жою"],
    "Удалить источник": ["Delete source", "Дереккөзді жою"],
    "Скопировать id-новости": ["Copy news id", "Жаңалық идентификаторын көшіру"],
    "Анализ": ["Analyze", "Анализ"],
    "Избранное": ["Favorites", "Таңдаулы"],
    "Уд. новость": ["Delete news", "Жаңалықты жою"],
    "Уд. источник": ["Delete source", "Дереккөзді жою"],

    "Удаление источника": ["Deleting a source", "Дереккөзді жою"],
    "Отмена": ["Cancel", "Болдырмау"],

    "Применить для всех?": ["Apply to everyone?", "Барлығына қолдану керек пе?"],
    "Это действие изменит все публикации данной группы": ["This action will change all publications of this group", "Бұл әрекет осы топтың барлық жарияланымдарын өзгертеді"],
    "Внимание": ["Warning", "Назар аударыңыз"],

    "Реакция": ["Reaction", "Реакция"],
    "Ответ": ["Answer", "Жауап"],
    "Ответы": ["Answers", "Жауаптар"],
    "Гражданин страны": ["Country citizen", "Ел азаматы"],
    "Анализ перспективы": ["Analysis of Perspective", "Перспективаны талдау"],

    "Представленная новость": ["Presented news", "Ұсынылған жаңалықтар"],
    "с точки зрения бизнеса": ["from a business point of view", "іскерлік тұрғыдан"],
    "с точки зрения государства": ["from the point of view of the state", "мемлекет тұрғысынан"],
    "с точки зрения граждан страны": ["from a citizen's point of view", "азаматтың көзқарасы бойынша"],
    "с точки зрения силовых структур": ["from the point of view of power structures", "күш құрылымдары тұрғысынан"],
    "с разных точек зрения": ["from different points of view", "әртүрлі көзқарастардан"],

    "Обобщение": ["Generalization", "Жалпылау"],
    "Обобщение публикаций": ["Generalization of publications", "Басылымдарды жалпылау"],
    "Ответ в прессу": ["Answer to the press", "Баспасөзге жауап"],
    "Проделанные запросы": ["Requests made", "Өтініштер жасалды"],
    "Условие": ["Condition", "Шарт"],
    "Выберите подходящую точку зрения": ["Choose a suitable point of view", "Дұрыс көзқарасты таңдаңыз"],
    "Выберите условие": ["Select condition", "Шартты таңдаңыз"],
    "Запуск": ["Launch", "Іске қосу"],
    "Информация и пояснение": ["Information and explanation", "Ақпарат және түсіндіру"],
    "Введите своё условие ...": ["Enter your condition ...", "Шартыңызды енгізіңіз ..."],
    "Своё условие": ["Own condition", "Өз жағдайы"],
    "Напиши ответ от лица правительства": ["Write a response on behalf of the government", "Үкімет атынан жауап жазыңыз"],
    "От чьего лица вы ожидаете ответ": ["From whom do you expect a response", "Сіз кімнен жауап күтесіз"],
    "Что передается в ChatGPT": ["What is transmitted in ChatGPT", "ChatGPT-те не беріледі"],
    "Предоставь мне подробный анализ данной новости": ["Give me a detailed analysis of this news", "Маған осы жаңалықтың егжей-тегжейлі талдауын беріңіз"],
    "Проанализируй данную новость и сформируй ответ на ее основе": ["Analyze this news and form an answer based on it", "Осы жаңалықты талдап, соның негізінде жауап құрастырыңыз"],
    "Предоставь мне главное из новости в 3-4 предложениях и выдели ключевые лица, игроков, компании и т.д. из новости": ["Give me the highlight of the news in 3-4 sentences and highlight key individuals, players, companies, etc. from the news", "Маған 3-4 сөйлеммен жаңалықтардың маңызды тұсын беріңіз және жаңалықтардан негізгі тұлғаларды, ойыншыларды, компанияларды және т.б. бөлектеңіз."],
    "Анализ новости": ["News analysis", "Жаңалықтарды талдау"],
    "Введите условие": ["Enter condition", "Шартты енгізіңіз"],
    "Введите от чьего лица вы ожидали ответ": ["Enter from whom you expected the answer", "Жауапты кімнен күткеніңізді енгізіңіз"],
    "Список пустой": ["List is empty", "Тізім бос"],
    "Бизнес": ["Business", "Бизнес"],
    "Государство": ["State", "Мемлекет"],
    "Силовые структуры": ["Power structures", "Күш құрылымдары"],
    "Разные точки зрения": ["Different points of view", "Әртүрлі көзқарастар"],
    "Скрыть": ["Hide", "Жасыру"],
    "Показать газету": ["Show newspaper", "Газет көрсету"],

    "Комментарии": ["Comments", "Пікірлер"],
    "Комментарии на парсинге": ["Comments on parsing", "Талдау бойынша түсініктемелер"],
    "Не получилось спарсить": ["Failed to parse", "Талдау орындалмады"],
    "Нет найденных комментариев": ["No comments found", "Пікірлер табылмады"],
    "Получить комментарии новости": ["Get news comments", "Жаңалықтар туралы пікірлерді алыңыз"],
    "Обновить": ["Refresh", "Жаңарту"],
    "Поиск по комментариям": ["Search by comments", "Пікірлер бойынша іздеу"],

    "Выберите избранное": ["Select your favorites", "Таңдаулыларыңызды таңдаңыз"],
    "Добавление в избранное": ["Adding to favorites", "Таңдаулыларға қосу"],
    "Поиск по избранным": ["Search by favorites", "Таңдаулылар бойынша іздеу"],
    "Введите название избранного...": ["Enter the name of the favorite...", "Таңдаулы атын енгізіңіз..."],
    "Создать": ["Create", "Жасау"],
    "Последняя страница": ["Last page", "Соңғы бет"],
};

import { langIs } from '@/response/utils/langIs'


function getLangIndex() {
    if (langIs("en")) return 0;
    else if (langIs("kz")) return 1;
}

const i18n = (text) => {
    if (text == undefined) {
        //console.log('i18n - text = ', text);
        return text;
    }
    text = text + "";
    if (_i18n[text.trim()] == undefined) return text;
    return langIs("ru") ? text.trim() : _i18n[text.trim()][getLangIndex()];
};

export default i18n;