const _i18n = {

    'Негативные': ['Negative', 'Негативті'],
    'Нейтральные': ['Neutral', 'Бейтарап'],
    'Позитивные': ['Positive', 'Позитивті'],

    'Негатив': ['Negative', 'Негатив'],
    'Нейтрал': ['Neutral', 'Бейтарап'],
    'Позитив': ['Positive', 'Позитив'],

    'Выберите период': ['Select a period', 'Деректерді жинау кезеңі'],

    'Пн': ['Mon', 'Дсн'],
    'Вт': ['Tue', 'Сейс'],
    'Ср': ['Wed', 'Сәрс'],
    'Чт': ['Thu', 'Бсн'],
    'Пт': ['Fri', 'Жм'],
    'Сб': ['Sat', 'Сб'],
    'Вс': ['Sun', 'Жс'],

    'За весь период': ['Whole period', 'Бүкіл кезең бойынша'],
    'Сегодня': ['Today', 'Бүгін'],
    'Вчера': ['Yesterday', 'Кеше'],
    'Неделя': ['Week', 'Апта'],
    '30 дней': ['30 days', '30 күн'],
    'Текущий месяц': ['This month', 'Осы ай'],
    'Прошлый месяц': ['Last month', 'Өткен ай'],

    "Январь": ['January', 'Қаңтар'],
    "Февраль": ['February', 'Ақпан'],
    "Март": ['March', 'Наурыз'],
    "Апрель": ['April', 'Сәуір'],
    "Май": ['May', 'Мамыр'],
    "Июнь": ['June', 'Маусым'],
    "Июль": ['July', 'Шілде'],
    "Август": ['August', 'Тамыз'],
    "Сентябрь": ['September', 'Қыркүйек'],
    "Октябрь": ['October', 'Қазан'],
    "Ноябрь": ['November', 'Қараша'],
    "Декабрь": ['December', 'Желтоқсан'],

    "Янв": ['Jan', 'Қаңтар'],
    "Фев": ['Feb', 'Aқпан'],
    //"Март": ['March', 'Наурыз'],
    "Апр": ['Apr', 'Сәуір'],
    //"Май": ['May', 'Мамыр'],
    //"Июнь": ['June', 'Маусым'],
    //"Июль": ['July', 'Шілде'],
    "Авг": ['Aug', 'Тамыз'],
    "Сент": ['Sept', 'Қыркүйек'],
    "Окт": ['Oct', 'Қазан'],
    "Ноя": ['Nov', 'Қараша'],
    "Дек": ['Dec', 'Желтоқсан'],

    "Воскресенье": ['Sunday', 'Жексенбі'],
    "Понедельник": ['Monday', 'Дүйсенбі'],
    "Вторник": ['Tuesday', 'Сейсенбі'],
    "Среда": ['Wednesday', 'Сәрсенбі'],
    "Четверг": ['Thursday', 'Бейсенбі'],
    "Пятница": ['Friday', 'Жұма'],
    "Суббота": ['Saturday', 'Сенбі'],

    'Применить': ["Apply", "Қолдану"],

    'Экспорт': ["Export", "Экспорт"],

    'Страны источников публикаций': ["Countries of publication sources", "Жаңалықтар дереккөздерінің мемлекеті"],
    'Регионы источников публикаций': ["Regions of publication sources", "Жаңалықтар дереккөздерінің аймақтары"],
    'Тональность по странам': ["Sentiment by country", "Мемлекет бойынша көңіл-күй"],
    'Тональность по регионам': ["Sentiment by region", "Аймақ бойынша көңіл-күй"],

    "Карта": ["Map", "Карта"],
    "Тональность": ["Sentiment", "Көңіл-күй"],

    "Абсолютный": ["Absolute", "Абсолютті"],
    "Доля": ["Proportion", "Бөлісу"],

    "Регионы": ["Regions", "Аймақтар"],
    "Все страны": ["All countries", "Мемлекеттер"],
    "Страна": ["Country", "Мемлекет"],

    "Регион": ["Region", "Аймақ"],
    "Публикаций": ["Publications", "Басылымдар"],
    "Публикация": ["Publication", "Басылым"],
    "Источников": ["Sources", "Дереккөздер"],
    "Источники": ["Sources", "Дереккөздер"],
    "Источник": ["Source", "Дереккөз"],
    
    "Динамика публикаций": ["Publication dynamics", "Жариялану динамикасы"],
    "Динамика публикаций по тональностям": ["Publication dynamics by sentiment", "Тональность бойынша жарияланымдар динамикасы"],

    "по часам<br/>• если период не более 7 дней": ["by hours<br/>• period is less than 7 days", "сағат бойынша<br/>• егер кезең 7 күннен аспаса"],
    "по дням": ["by days", "күндер бойынша"],
    "по неделям<br/>• если период от 7 дней": ["by weeks<br/>• period is from 7 days", "апталар бойынша<br/>• егер кезең 7 күннен бастап болса"],
    "по месяцам<br/>• если период от 3 дней": ["by months<br/>• period is from 3 days", "айлар бойынша<br/>• егер кезең 3 күннен бастап болса"],

    "Язык публикаций": ["Publication language", "Жаңалықтар тілі"],
    "Казахский": ["Kazakh", "Қазақ"],
    "Русский": ["Russian", "Орыс"],
    "Английский": ["English", "Ағылшын"],
    "Другие": ["Others", "Басқа"],

    "Категория": ["Category", "Категория"],
    "Категория источника": ["Source category", "Дереккөз категориясы"],
    "Государственные источники": ["Government sources", "Мемлекеттік ақпарат көздері"],
    "Информационные агентства": ["News agencies", "Ақпарат агенттіктері"],
    "Региональные источники": ["Regional sources", "Аймақтық дереккөздер"],
    "Электронные СМИ": ["Electronic media", "Электрондық ақпарат құралдары"],
    "Специализированные": ["Specialized", "Мамандандырылған"],
    "Зарубежные источники": ["Foreign sources", "Шетелдік ақпарат көздері"],
    "Государственные закупки": ["State procurements", "Мемлекеттік сатып алулар"],
    "LiveJournal": ["LiveJournal", "Live Journal"],
    "Печатные СМИ": ["Print mass-media", "Баспа құралдары"],
    "Телевидение": ["TV", "Теледидар"],
    "Радио": ["Radio", "Радио"],
    "Агрегаторы СМИ": ["Media aggregators", "Медиа агрегаторлар"],
    "Печатные издания": ["Printed editions", "Баспа басылымдары"],

    "Метрики соцсетей": ["Social metrics", "Әлеуметтік медиа метрикалары"],
    "Реакции": ["Reactions", "Реакциялар"],
    "Репосты": ["Reposts", "Репосттар"],
    "Подписчики": ["Subscribers", "Жазылушылар"],

    "Источники публикаций": ["Publication sources", "Жаңалық көздері"],
    "Тональность источников": ["Sentiment of sources", "Дереккөздердің көңіл-күйі"],

    "Количество публикаций": ["Number of publications", "Жарияланымдар саны"],
    "Доля публикаций на выделенных источниках": ["Share of publications on selected sources", "Таңдалған дереккөздер бойынша жарияланымдар үлесі"],

    "При сборе метрик для большого числа публикаций метрики по умолчанию выкл.": [
        "When collecting metrics for a large number of posts, the default metrics are off.",
        "Жазбалардың көп саны үшін көрсеткіштерді жинаған кезде, әдепкі көрсеткіштер өшірулі."
    ],
    "Идёт сбор метрик для большого числа публикаций.": [
        "There is a collection of metrics for a large number of publications.",
        "Жарияланымдар санының көптігі үшін көрсеткіштер жинағы бар."
    ],
    "Будет готово через несколько секунд🤓": [
        "Will be ready in a few seconds🤓",
        "Бірнеше секундта дайын болады🤓"
    ],

    "Результат фильтра": ["Filter Result", "Фильтрдің нәтижесі"],

    "Сортировка по реакция (по убыванию)": ["Sort by reactions (desc)", "Реакция бойынша сұрыптау (төмендету)"],
    "Сортировка по комментариям (по убыванию)": ["Sort by comments (desc)", "Түсініктемелер бойынша сұрыптау (төмендету)"],
    "Сортировка по репостам (по убыванию)": ["Sort by reposts (desc)", "Репосттар бойынша сұрыптау (төмендету)"],
    "Сортировка по аудитории (по убыванию)": ["Sort by audience (desc)", "Аудитория бойынша сұрыптау (төмендету)"],
    "Сортировка по дате (по убыванию)": ["Sort by date (desc)", "Күні бойынша сұрыптау (төмендету)"],

    "По одной": ["One by one", "Бір-бірден"],
    "По группам": ["By groups", "Топтар бойынша"],

    "Удалить новость": ["Delete news", "Жаңалықты жою"],
    "Удалить источник": ["Delete source", "Дереккөзді жою"],
    "Скопировать id-новости": ["Copy news id", "Жаңалық идентификаторын көшіру"],
    "Анализ": ["Analyze", "Анализ"],
    "Анализ ChatGPT": ["ChatGPT analysis", "ChatGPT талдауы"],

    "Пресс-релиз": ["Press release", "Баспасөз хабарламасы"],
    "План действий таблицей": ["Action plan table", "Іс-шаралар жоспарының кестесі"],
    "Выработай рекомендации": ["Make recommendations", "Ұсыныстар жасаңыз"],
    "Негатив в позитив": ["Negative to positive", "Жағымсыздан оңға"],

    "от организации ... в позитивном ключе, объемом на английском языке.": ["from the organization ... in a positive way, in English.", "ұйымнан ... позитивті түрде, ағылшын тілінде."],
    "и составь пресс-релиз по этой публикации, объемом до 1800 знаков, на русском языке": ["and write a press release on this publication, up to 1800 characters, in Russian", "және осы басылымға 1800 таңбаға дейін орыс тілінде пресс-релиз жазыңыз"],
    "и составь план действий для всех участников этой ситуации для ее разрешения и улучшения": ["and draw up an action plan for all participants in this situation to resolve and improve it", "және оны шешу және жақсарту үшін осы жағдайдың барлық қатысушылары үшін іс-қимыл жоспарын жасаңыз"],
    "и выработай список из 3-5 рекомендаций для улучшения деятельности организации ... по описанной ситуации": ["and develop a list of 3-5 recommendations to improve the organization’s activities... for the described situation", "және сипатталған жағдайға байланысты ұйымның қызметін жақсарту бойынша 3-5 ұсынымдар тізімін әзірлеу"],
    "и предложи 5 идей как отреагировать на эту публикацию так, чтобы негативный эффект для организации ... перевести в позитивный": ["and offer 5 ideas on how to respond to this publication so that the negative effect for the organization... turns into a positive one", "және ұйымға кері әсер ету... оңға айналуы үшін осы жарияланымға қалай жауап беру керектігі туралы 5 идеяны ұсыныңыз."],

    "Избранное": ["Tags", "Таңдаулы"],
    "Уд. новость": ["Delete news", "Жаңалықты жою"],
    "Уд. источник": ["Delete source", "Дереккөзді жою"],

    "Удаление источника": ["Deleting source", "Дереккөзді жою"],
    "Отмена": ["Cancel", "Болдырмау"],
    "Закрыть": ["Close", "Жабу"],

    "Применить для всех?": ["Apply to each?", "Барлығына қолдану керек пе?"],
    "Это действие изменит все публикации данной группы": ["This action will change all publications of this group", "Бұл әрекет осы топтың барлық жарияланымдарын өзгертеді"],
    "Внимание": ["Warning", "Назар аударыңыз"],

    "Реакция": ["Reaction", "Реакция"],
    "Ответ": ["Response", "Жауап"],
    "Ответы": ["Responses", "Жауаптар"],
    "Граждане страны": ["Country citizens", "Ел азаматтары"],
    "Анализ перспективы": ["Perspective analysis", "Перспективаны талдау"],

    "Представленная новость": ["Presented news", "Ұсынылған жаңалықтар"],
    "с точки зрения бизнеса": ["from a business point of view", "іскерлік тұрғыдан"],
    "с точки зрения государства": ["from the state's point of view", "мемлекет тұрғысынан"],
    "с точки зрения граждан страны": ["from a citizen's point of view", "азаматтың көзқарасы бойынша"],
    "с точки зрения силовых структур": ["from security forces point of view", "қауіпсіздік күштері тұрғысынан"],
    "с разных точек зрения": ["from different points of view", "әртүрлі көзқарастардан"],

    "Обобщение": ["Summary", "Жалпылау"],
    "Обзор публикации": ["Publication summary", "Басылымдарды қорытынды"],
    "Ответ в прессу": ["Public response", "Баспасөзге жауап"],
    "Проделанные запросы": ["Requests made", "Өтініштер жасалды"],
    "Условие": ["Condition", "Шарт"],
    "Выберите подходящую точку зрения": ["Choose a suitable point of view", "Дұрыс көзқарасты таңдаңыз"],
    "Выберите условие": ["Select condition", "Шартты таңдаңыз"],
    "Запуск": ["Launch", "Іске қосу"],
    "Информация": ["Information", "Ақпарат"],
    "Введите своё условие...": ["Enter your request...", "Шартыңызды енгізіңіз ..."],
    "Своё условие": ["Your category", "Өз жағдайы"],
    "Деятеля, компании и т.д.": ["Executive, company etc.", "Жеке тұлғалар, компаниялар және т.б."],
    "Укажите, от кого сформулировать обращение": ["Enter on what behalf you expect it to be", "Шағымды кімнен құрастыру керектігін көрсетіңіз"],
    "Что передается в ChatGPT": ["What is transmitted in ChatGPT", "ChatGPT-те не беріледі"],
    "Проведите подробный анализ данной новости": ["Conduct a detailed analysis of this publication", "Осы жарияланымға толық талдау жасаңыз"],
    "Проанализируйте данную новость и сформируйте публичный комментарий для прессы по событию от лица": ["Analyze this news and prepare the public media response on behalf of", "Осы жаңалықты талдап, соның негізінде жауап құрастырыңыз"],
    "Сформулируйте главную информацию новости в 3-4 предложения. Затем выделите основных действующих лиц, компании, службы": ["Summarize the main information of the news in 3-4 sentences. Then highlight main actors, companies, services", "Маған 3-4 сөйлеммен жаңалықтардың маңызды тұсын беріңіз және жаңалықтардан негізгі тұлғаларды, ойыншыларды, компанияларды және т.б. бөлектеңіз"],
    "Анализ новости": ["News analysis", "Жаңалықтарды талдау"],
    "Введите условие": ["Enter condition", "Шартты енгізіңіз"],
    "Введите, от чьего лица вы ожидали ответ": ["Enter the subject you expected the answer to be from", "Жауапты кімнен күткеніңізді енгізіңіз"],
    "Список пуст": ["List is empty", "Тізім бос"],
    "Бизнес": ["Business", "Бизнес"],
    "Государство": ["State", "Мемлекет"],
    "Силовые структуры": ["Security forces", "Қауіпсіздік күштері"],
    "Разные точки зрения": ["Different points of view", "Әртүрлі көзқарастар"],
    "Скрыть": ["Hide", "Жасыру"],
    "Показать газету": ["Show newspaper", "Газет көрсету"],

    "Комментарии": ["Comments", "Пікірлер"],
    "Комментарии собираются": ["Comments are being collected", "Пікірлер жиналуда"],
    "Не получилось собрать": ["Failed to collect", "Жинау сәтсіз аяқталды"],
    "Нет найденных комментариев": ["No comments found", "Пікірлер табылмады"],
    "Получить комментарии новости": ["Get news comments", "Жаңалықтар туралы пікірлерді алыңыз"],
    "Обновить": ["Refresh", "Жаңарту"],
    "Поиск по комментариям": ["Search by comments", "Пікірлер бойынша іздеу"],

    "Выберите избранное": ["Select tag", "Таңдаулыларыңызды таңдаңыз"],
    "Добавление в избранное": ["Adding tag", "Таңдаулыларға қосу"],
    "Поиск по избранным": ["Search by tag", "Таңдаулылар бойынша іздеу"],
    "Введите название избранного...": ["Enter the tag name...", "Таңдаулы атын енгізіңіз..."],
    "Создать": ["Create", "Жасау"],
    "Последняя страница": ["Last page", "Соңғы бет"],





    "Анализ перспективы - это инструмент, при помощи которого вы можете получить от языковой модели подробный анализ публикации с той или иной точки зрения. На вход GPT подается выражение - запрос: <b>\"Проведите подробный анализ данной новости с точки зрения ...\"</b> <br> В меню <b>\"Условие\"</b> можно выбрать одну из общественных групп или задать свою.<br><br> После выбора нажмите <b>\"Запуск\"</b> и подождите, пока сформируется ответ (10-20 секунд).": ["Perspective analysis is a tool to obtain a language model analysis of the publication from a particular point of view. The input for GPT is a request: <b>\"Conduct a detailed analysis of this publication from the point of view of ...\" </b> <br>In the <b>\"Condition\"</b> menu you can select one of the social groups or set your own. <br><br>After selection, click <b>\"Launch\"</b> and wait for the response to be generated (10-20 seconds).", "Перспективалық талдау – тілдік модельден белгілі бір көзқарас бойынша басылымның егжей-тегжейлі талдауын алуға болатын құрал. GPT кірісі өрнекті - сұрауды алады: <b>«Осы жаңалыққа ... тұрғысынан толық талдау жасаңыз»</b> <br> <b>\"Жағдай\"</b> мәзірінде жалпыға ортақ топтардың бірін таңдауға немесе өзіңіздің топты орнатуға болады.<br><br> Таңдағаннан кейін <b>\"Іске қосу\"</b> түймесін басып, жауап қалыптасқанша күтіңіз (10-20 секунд)."],


    "Ответ - это инструмент, при помощи которого Вы можете сформулировать публичный комментарий по событию от лица различных акторов. Например, от гендиректора, пресс-службы, представителя администрации и других лиц. <br><br> На вход подается запрос: <b>\"Проанализируйте данную новость и сформируйте публичный комментарий для прессы по событию от лица ...\"</b>  В поле для ввода укажите, от чьего лица необходимо сформулировать ответ.": ["Public response is a tool to obtain a public comment on an event formulated on behalf of various actors. For example, from the CEO, press service, administration representative and others. <br><br> The input is a request: <b>\"Analyze this news and prepare the public media response on behalf of ...\"</b>.  In the input field, specify on whose behalf you would like to formulate a response.", "Жауап - әртүрлі актерлердің атынан оқиғаға көпшілікке түсініктеме беруге болатын құрал. Мысалы, бас директордан, баспасөз қызметінен, әкімшілік өкілінен және басқа да тұлғалардан. <br><br> Кіріс мекенжайына сұрау жіберіледі: <b>\"Осы жаңалықты талдаңыз және ... атынан оқиғаға баспасөзге қоғамдық түсініктеме жасаңыз\"</b> Енгізу өрісінде жауапты кімнің атынан құрастырғыңыз келетінін көрсетіңіз."],

    
    "Обобщение - это инструмент, при помощи которого вы можете обобщить новость, а также выделить ключевых акторов. <br> На вход языковой модели подается текст публикации и выражение-запрос: <b>\"Сформулируйте главную информацию новости в 3-4 предложения. Затем выделите основных действующих лиц, компании, службы\"</b>. <br><br> Кнопка <b>\"Запуск\"</b> отправит запрос в GPT. Ответ станет доступен через 10-20 секунд.": ["Summary is a tool to summarize the news, as well as identify key actors.<br> The input of the language model is the text of the publication and the request phrase: <b>\"Summarize the main information of the news in 3-4 sentences. Then highlight the main actors, companies, services\"</b>.<br><br> The <b>\"Launch\"</b> button sends the request to GPT. The response will be available in 10-20 seconds.", "Қорытындылау – жаңалықтарды қорытындылауға, сондай-ақ негізгі тұлғаларды бөлектеуге болатын құрал. <br> Тілдік модельдің кірісі басылымның мәтіні және сұраныс өрнегі болып табылады: <b>«Жаңалықтың негізгі ақпаратын 3-4 сөйлеммен тұжырымдаңыз. Содан кейін негізгі актерлерді, компанияларды, қызметтерді таңдаңыз»</b>. <br><br> <b>\"Іске қосу\"</b> түймесі сұрауды GPT-ке жібереді. Жауап 10-20 секундта қол жетімді болады."],

    "групп новостей": ["groups of news", "жаңалықтар тобы"],
    "новостей": ["news", "жаңалықтар"],
    "источников": ["sources", "дереккөздер"],
    "Группирование публикаций проводится с": ["Grouping of publications has been carried out since", ""],
    "Сгенерируй название этой беседы (ближе к сути), длиной не более 50 символов.": ["Generate a title for this conversation (closer to the point), no more than 50 characters long.", "Ұзындығы 50 таңбадан аспайтын осы әңгімеге тақырып жасаңыз (нүктеге жақынырақ)."],
    "Создать чат": ["New Chat", "Чат құру"],
    "Отправить сообщение": ["Send a message", "Хабарлама жіберу"],

    "Удалить чат?": ["Delete chat?", "Чатты жою керек пе?"],
    "Будет удален следующий чат": ["The following chat will be deleted", "Келесі чат жойылады"],
    "Удалить": ["Delete", "Жою"],

    "Ошибка при формировании ответа": ["Error while generating response", "Жауапты жасау кезіндегі қате"],
    "Извините, ваш запрос содержит слишком много слов.": ["Sorry, your request contains too many words.", "Кешіріңіз, сұрауыңызда тым көп сөз бар."],
    "Пожалуйста, сократите текст запроса.": ["Please shorten your request text.", "Өтініш мәтінін қысқартыңыз."],
    "Хорошо": ["Fine", "Жақсы"],

    "бизнес": ["business", "бизнес"],
    "государство": ["state", "мемлекет"],
    "граждане страны": ["citizens of the country", "ел азаматтары"],
    "сил.структуры": ["security forces", "қауіпсіздік күштері"],
    "разные т.з.": ["different points of view", "әртүрлі көзқарастар"],

    "пресс-релиз": ["press release", "баспасөз хабарламасы"],
    "план действий таблицей": ["action plan table", "іс-шаралар жоспарының кестесі"],
    "выработай рекомендации": ["make recommendations", "ұсыныстар жасаңыз"],
    "негатив в позитив": ["negative to positive", "жағымсыздан оңға"],

    "Введите своё условие ...": ["Enter your condition...", "Шартыңызды енгізіңіз..."],
    "Своё обращение от ...": ["Your message from...", "Сіздің хабарламаңыз..."],
    "Позитивный комментарий": ["Positive comment", "Позитивті пікір"],
    "Ввести своё условие ... для анализа": ["Enter your condition... for analysis", "Талдау үшін... жағдайыңызды енгізіңіз"],
    "Свой запрос": ["Your request", "Сіздің өтінішіңіз"],
};

import { langIs } from '@/response/utils/langIs'


function getLangIndex() {
    if (langIs("en")) return 0;
    else if (langIs("kz")) return 1;
}

const i18n = (text) => {
    if (text == undefined) {
        //console.log('i18n - text = ', text);
        return text;
    }
    text = text + "";
    if (_i18n[text.trim()] == undefined) return text;
    return langIs("ru") ? text.trim() : _i18n[text.trim()][getLangIndex()];
};

export default i18n;